# Scenario 2

Import libraries

In [1]:
import pandas as pd

Read in SIS and State data

In [2]:
df_sis = pd.read_excel('data.xlsx', sheet_name=1)
df_state = pd.read_excel('data.xlsx', sheet_name=2)

In [3]:
df_sis.head()

,School,StudentID,StateID,FirstName,LastName,Gender,Grade,DOB,Ethnicity,EntryDate,ExitDate
0,OUJH,15524,6137711.0,Milad,Abdulaziz,M,9.0,2000-09-15,B,2015-08-01,2016-05-31
1,OUJH,92924,7767550.0,Caspian,Amelio,M,9.0,2001-04-18,B,2015-08-01,2016-05-31
2,OUJH,76151,7020160.0,Melanie,Aragoni,F,9.0,2001-06-25,B,2015-08-01,2016-05-31
3,OUJH,46166,9149101.0,Lucia,Bingman,F,9.0,2000-09-28,B,2015-08-01,2016-05-31
4,OUJH,83230,6182781.0,Andrew,Blacio,M,9.0,2001-06-28,B,2015-08-01,2016-05-31

In [4]:
df_state.head()
len(df_state)

2933

SIS df with StateID, StudentID, FirstName, LastName

In [5]:
df1 = df_sis[['StudentID', 'StateID', 'FirstName', 'LastName']].copy()

In [6]:
df1.head()

   StudentID    StateID FirstName   LastName
0      15524  6137711.0     Milad  Abdulaziz
1      92924  7767550.0   Caspian     Amelio
2      76151  7020160.0   Melanie    Aragoni
3      46166  9149101.0     Lucia    Bingman
4      83230  6182781.0    Andrew     Blacio

Create df2 from state with StateID, ExitDate, and Classification

In [7]:
df2 = df_state[['StateID', 'ExitDate', 'Classification']].copy()

In [8]:
df2.head()

   StateID ExitDate  Classification
0  6137711      NaT               3
1  7767550      NaT               4
2  7020160      NaT               3
3  9149101      NaT               2
4  6182781      NaT               2

Fill null values AKA 'NAT' values with 0 to be able to target them

In [9]:
df2.fillna(0, inplace=True)

Find the index for rows where ExitDate is 0 AKA null. This means that the student has not exited the school.

In [10]:
index_null = df2[ df2['ExitDate'] == 0 ].index

Drop the rows that correspond to students who are still enrolled in the school since we only want to keep students who have exited

In [11]:
df2.drop(index=index_null, inplace= True)

In [12]:
len(df2)

20

In [13]:
df2.head()

     StateID             ExitDate  Classification
28   4864706  2015-11-04 00:00:00               3
110  2190759  2015-12-01 00:00:00               3
181  1988573  2016-01-05 00:00:00               3
247  7592043  2015-09-01 00:00:00               1
294  3901730  2015-08-04 00:00:00               3

Join df2 with df1 on the key StateID with a left join

In [14]:
df_exits = pd.merge(df2, df1, on='StateID', how='left')

In [15]:
len(df_exits)

20

In [16]:
df_exits

,StateID,ExitDate,Classification,StudentID,FirstName,LastName
0,4864706,2015-11-04 00:00:00,3,29973,Sebastian,Derbes
1,2190759,2015-12-01 00:00:00,3,94599,Edelyn,Plauche
2,1988573,2016-01-05 00:00:00,3,20769,Analiese,Carvell
3,7592043,2015-09-01 00:00:00,1,23095,Joseph,Lungsford
4,3901730,2015-08-04 00:00:00,3,11647,Cadon,Siltman
5,2891804,2015-10-01 00:00:00,4,87968,Bryssa,Blatnick
6,5663175,2016-02-02 00:00:00,4,98747,Cayden,Lazenby
7,4548263,2015-10-22 00:00:00,3,85526,Victoria,Zettlemoyer
8,5728933,2015-10-04 00:00:00,2,81708,Giovani,Terazes
9,6570230,2015-11-12 00:00:00,2,54294,Jesus,Lambka
10,6201999,2015-08-22 00:00:00,3,34572,Mason,Prebish
11,4828271,2015-11-16 00:00:00,3,74334,Colton,Matkowski
12,9033510,2015-09-14 00:00:00,4,79229,Abigail,Greeves
13,7668328,2016-02-02 00:00:00,3,56220,Isaac,Hauenstein
14,8203239,2015-09-20 00:00:00,1,98671,Fizza,Breu
15,1007374,2015-10-03 00:00:00,2,70164,Jocelynne,Lagonia
16,1289371,2015-12-15 00:00:00,1,62259,Ximena,Yonkoske
17,2975410,2015-11-05 00:00:00,3,72211,Maria,Kasperek
18,8790082,2016-02-01 00:00:00,4,77147,Laney,Lavallee
19,7923775,2015-12-14 00:00:00,2,13855,Jose,Pala

In [17]:
df_exits.to_csv('exit_report.csv')